Revit 2024 API
ParameterTypeId.ViewDesignOptionsConfig Property
 "Design Option Configuration"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewDesignOptionsConfig { get; }
Visual Basic
Public Shared ReadOnly Property ViewDesignOptionsConfig As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewDesignOptionsConfig {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace